package com.gdptc.society.fragment;

/**
 * @创建者 Administrator
 * @创建时间 2016/4/11 10:39
 * @描述 ${TODO}
 * @更新者 $Author$
 * @更新时间 $Date$
 * @更新描述 ${TODO}
 */
public class AddressFragemnt extends BaseFragment {
    String catalogues[][] = new String[][]{
            new String[]{"社团介绍", "社团小干", "社团成员", "精彩日常照", "阶段训练", "比赛详情", "活动ing", "趣味喊稿", "社团嘉年华", "招贤纳士", "社团联谊",
                    "其他"},
            new String[]{"社团介绍", "社团小干", "社团成员", "精彩日常照", "阶段训练", "比赛详情", "活动ing", "趣味喊稿", "社团嘉年华", "招贤纳士", "社团联谊",
                    "其他"},
            new String[]{"社团介绍", "社团小干", "社团成员", "精彩日常照", "阶段训练", "比赛详情", "活动ing", "趣味喊稿", "社团嘉年华", "招贤纳士", "社团联谊",
            "其他"},
            new String[]{"社团介绍", "社团小干", "社团成员", "精彩日常照", "阶段训练", "比赛详情", "活动ing", "趣味喊稿", "社团嘉年华", "招贤纳士", "社团联谊",
            "其他"},
            new String[]{"社团介绍", "社团小干", "社团成员", "精彩日常照", "阶段训练", "比赛详情", "活动ing", "趣味喊稿", "社团嘉年华", "招贤纳士", "社团联谊",
                    "其他"},
            new String[]{"社团介绍", "社团小干", "社团成员", "精彩日常照", "阶段训练", "比赛详情", "活动ing", "趣味喊稿", "社团嘉年华", "招贤纳士", "社团联谊",
                    "其他"},
            new String[]{"社团介绍", "社团小干", "社团成员", "精彩日常照", "阶段训练", "比赛详情", "活动ing", "趣味喊稿", "社团嘉年华", "招贤纳士", "社团联谊",
                    "其他"},
            new String[]{"社团介绍", "社团小干", "社团成员", "精彩日常照", "阶段训练", "比赛详情", "活动ing", "趣味喊稿", "社团嘉年华", "招贤纳士", "社团联谊",
                    "其他"},
            new String[]{"社团介绍", "社团小干", "社团成员", "精彩日常照", "阶段训练", "比赛详情", "活动ing", "趣味喊稿", "社团嘉年华", "招贤纳士", "社团联谊",
                    "其他"},
            new String[]{"社团介绍", "社团小干", "社团成员", "精彩日常照", "阶段训练", "比赛详情", "活动ing", "趣味喊稿", "社团嘉年华", "招贤纳士", "社团联谊",
                    "其他"},
            new String[]{"社团介绍", "社团小干", "社团成员", "精彩日常照", "阶段训练", "比赛详情", "活动ing", "趣味喊稿", "社团嘉年华", "招贤纳士", "社团联谊",
                    "其他"},
            new String[]{"社团介绍", "社团小干", "社团成员", "精彩日常照", "阶段训练", "比赛详情", "活动ing", "趣味喊稿", "社团嘉年华", "招贤纳士", "社团联谊",
                    "其他"},
            new String[]{"社团介绍", "社团小干", "社团成员", "精彩日常照", "阶段训练", "比赛详情", "活动ing", "趣味喊稿", "社团嘉年华", "招贤纳士", "社团联谊",
                    "其他"},
    };
    String catalogues1[] = new String[]{"动漫社", "一个字话剧团", "小荷文学社", "魔术协会",
            "英语角协会", "心理协会", "街舞社", "乒乓球俱乐部", "篮球", "网球", "羽毛球", "足球", "排球"};

    /**
     * --------------------------------加载数据------------------------------
     **/
    @Override
    protected String[][] setCatalogues2() {
        //开线程异步加载数据
        return catalogues;
    }

    @Override
    protected String[] setCatalogues1() {
        return catalogues1;
    }
    /**--------------------------------设置页面------------------------------**/

}
